{
    "general_score": {
        "GPTZero": 0,
        "Writer": 1,
        "Sapling AI": 1
    },
    "sentence_score": [
        {
            "Chicken nugget this sentence is generated by a human.": {
                "highlight": 0,
                "api": []
            }
        },
        {
            "Singapore Polytechnic (SP) is a renowned institution offering a diverse range of diploma courses and fostering a culture of academic excellence, practical learning, and industry partnerships.": {
                "highlight": 0,
                "api": []
            }
        },
        {
            "With state-of-the-art facilities and dedicated faculty, SP equips students with the skills and knowledge needed for their chosen fields.": {
                "highlight": 0.25,
                "api": [
                    "Sapling AI"
                ]
            }
        },
        {
            "The institution emphasizes experiential learning, project-based education, and industry attachments to prepare graduates for successful careers.": {
                "highlight": 0,
                "api": []
            }
        },
        {
            "SP also encourages innovation, entrepreneurship, and holistic development through its vibrant campus life and co-curricular activities.": {
                "highlight": 0,
                "api": []
            }
        },
        {
            "Overall, Singapore Polytechnic is a leading institution that provides a comprehensive and dynamic educational experience to shape the future professionals of Singapore.": {
                "highlight": 0.25,
                "api": [
                    "Sapling AI"
                ]
            }
        },
        {
            "Singapore Polytechnic (SP) is one of the leading tertiary institutions in Singapore, renowned for its commitment to academic excellence, industry relevance, and nurturing innovative thinkers.": {
                "highlight": 0.25,
                "api": [
                    "Sapling AI"
                ]
            }
        },
        {
            "Established in 1954, SP has since evolved into a dynamic and vibrant institution, offering a wide range of diploma courses across various disciplines.": {
                "highlight": 0,
                "api": []
            }
        }
    ]
}