{
    "overall_score": {
        "AIGCD APIs": {
            "GPTZero": 6.4,
            "Writer": "score not calculated",
            "Sapling AI": "score not calculated",
            "Hugging Face": 0.1,
            "average_score": 3.2
        },
        "Misinformation APIs": {
            "In-house Model": 83.4,
            "average_score": 83.4
        },
        "Hate Speech APIs": {
            "Moderate Hate Speech": 0.0,
            "average_score": 0.0
        },
        "sentence_data": {
            "total_num_sentences": 4,
            "1": 4
        }
    },
    "1": {
        "general_score": {
            "AIGCD APIs": {
                "description": "Probability that text is generated by AI",
                "score_type": "Continuous",
                "GPTZero": 6.4,
                "overall_score": 3.2,
                "Writer": "error getting score",
                "Sapling AI": "error getting score",
                "Hugging Face": 0.1
            },
            "Misinformation APIs": {
                "description": "Probability that text is misinformation",
                "score_type": "Continuous",
                "In-house Model": 83.4,
                "overall_score": 83.4
            },
            "Hate Speech APIs": {
                "description": "Percentage of APIs flagging text as hate speech",
                "score_type": "Discrete",
                "Moderate Hate Speech": 0.0,
                "overall_score": 0.0
            }
        },
        "sentence_score": [
            {
                "WASHINGTON—According to a poll released Friday by the Pew Research Institute, the majority of voting-age Americans would prefer to cast their ballot for a tiny little president who wears a tiny little tuxedo and tap-dances atop a podium.": {
                    "AIGCD APIs": [],
                    "AIGCD APIs-highlight": 0
                }
            },
            {
                "“In our nationwide survey, we found that 64% of U.S. voters would like a president who does not give speeches, set administration policy, or meet with other world leaders, but instead stands 5 inches tall, sports a bowler hat, and twirls a cane during press briefings,” said Pew Research pollster Ridley Wood, who showed reporters a graph that illustrated how most of the 1,500 citizens polled thought the tiny president should sleep inside one of the drawers of the Resolute desk and wake up smiling each morning as he puts on his tap shoes.": {
                    "AIGCD APIs": [],
                    "AIGCD APIs-highlight": 0
                }
            },
            {
                "“Across the political spectrum, voters want this pocket-size commander in chief to speak in a high-pitched, singsong voice that—while it can barely be understood by the American public—is absolutely adorable.": {
                    "AIGCD APIs": [],
                    "AIGCD APIs-highlight": 0
                }
            },
            {
                "Perhaps most surprisingly, poll respondents said they would vote for such a president regardless of his party affiliation, so long as he was married to a doll who talked when you pulled on a string and he flew around on a bald eagle named Air Force One.” The survey found that the remaining 36% of citizens would like to vote for a president so huge he could crush the White House with his fist and go on a rampage through the National Mall yelling, ‘President smash!”": {
                    "AIGCD APIs": [],
                    "AIGCD APIs-highlight": 0
                }
            }
        ],
        "flags": [
            "Flagged by $Misinformation APIs"
        ]
    }
}